import os

# ==============================
# ID РОЛЕЙ
# ==============================

AUTO_ROLE_ID = 1521855978394353664

ALLOWED_MOD_ROLE_ID = 1521855842964471918

ALLOWED_VOICE_ROLES = [
    1521855842964471918,
    1521979923819004125
]


# ==============================
# ID КАНАЛОВ
# ==============================

LOG_CHANNEL_ID = 1532095199046537308

REMIND_CHANNEL_ID = 1539276527244541976

TEMP_TEXT_CATEGORY_ID = 1539312584669536327

TEMP_VOICE_CATEGORY_ID = 1532095199046537308

ALLOWED_GAME_CHANNEL_ID = 1525848983203877116


# ==============================
# ID АДМИНИСТРАТОРА
# ==============================

ADMIN_ID = 1484872373932130335



# ==============================
# DISCORD WEBHOOK
# ==============================

WEBHOOK_URL = os.getenv("WEBHOOK_URL")
